In [36]:
import pandas as pd
import numpy as np

In [37]:
dd={'oop':{'3rd':22},'java':{'5th':60},"Ds":{'6th':51}}

In [38]:
df=pd.DataFrame(dd)

In [4]:
df

       Ds  java   oop
3rd   NaN   NaN  22.0
5th   NaN  60.0   NaN
6th  51.0   NaN   NaN

# handling missing values in data frame

In [5]:
df.fillna(method='ffill',inplace=True)

In [6]:
df

       Ds  java   oop
3rd   NaN   NaN  22.0
5th   NaN  60.0  22.0
6th  51.0  60.0  22.0

In [7]:
df.fillna(method='bfill')

       Ds  java   oop
3rd  51.0  60.0  22.0
5th  51.0  60.0  22.0
6th  51.0  60.0  22.0

# perform functions on dataframe

In [39]:
arr1=np.array([[10,12,13],[14,15,16],[12,18,19]])

In [40]:
df1=pd.DataFrame(arr1)

In [41]:
df1

    0   1   2
0  10  12  13
1  14  15  16
2  12  18  19

In [42]:
df1.describe()

          0     1     2
count   3.0   3.0   3.0
mean   12.0  15.0  16.0
std     2.0   3.0   3.0
min    10.0  12.0  13.0
25%    11.0  13.5  14.5
50%    12.0  15.0  16.0
75%    13.0  16.5  17.5
max    14.0  18.0  19.0

In [43]:
df1.sum()

0    36
1    45
2    48
dtype: int64

In [44]:
df1.sum(axis=1)

0    35
1    45
2    49
dtype: int64

In [45]:
df1[3]=[5,4,1]

In [49]:
df1

    0   1   2  3
0  10  12  13  5
1  14  15  16  4
2  12  18  19  1

In [52]:
df1.sort_values(by=3)

    0   1   2  3
2  12  18  19  1
1  14  15  16  4
0  10  12  13  5